oe-rv2309/mugen-x86/logs/fio/oe_test_fio_002/2023-08-22-02_53_55.log
+ source ./common/disk_lib.sh
++ source /root/mugen/libs/locallibs/common_lib.sh
+++ python3 --version
+++ '[' 0 -eq 0 ']'
+++ source /root/mugen/libs/locallibs/common_lib_python.sh
+ main
++ type -t post_test
+ '[' -n function ']'
+ trap post_test EXIT INT HUP TERM
+ rpm -qa
+ grep expect
++ type -t config_params
+ '[' -n '' ']'
++ type -t pre_test
+ '[' -n function ']'
+ pre_test
+ LOG_INFO 'Start to prepare the test environment!'
+ message='Start to prepare the test environment!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Start to prepare the test environment!'
Tue Aug 22 02:53:55 2023 - INFO  - Start to prepare the test environment!
+ check_free_disk
++ TEST_DISK
++ id=1
++ python3 /root/mugen/libs/locallibs/get_test_device.py --device disk --node 1
+ disks='sr0 vdb'
+ disk_list=($disks)
+ local_disk=sr0
+ local_disk1=vdb
+ local_disk2=
+ local_disk3=
+ DNF_INSTALL fio
+ pkgs=fio
+ node=1
+ '[' -z '' ']'
+ tmpfile=
++ python3 /root/mugen/libs/locallibs/rpm_manage.py install --pkgs fio --node 1 --tempfile ''
+ tmpfile2=/tmp/tmp8_encupy
+ '[' -z '' ']'
+ tmpfile=/tmp/tmp8_encupy
+ test -f test.txt
+ touch test.txt
+ LOG_INFO 'End to prepare the test environment!'
+ message='End to prepare the test environment!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'End to prepare the test environment!'
Tue Aug 22 02:59:50 2023 - INFO  - End to prepare the test environment!
++ type -t run_test
+ '[' -n function ']'
+ run_test
+ LOG_INFO 'Start executing testcase!'
+ message='Start executing testcase!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Start executing testcase!'
Tue Aug 22 02:59:50 2023 - INFO  - Start executing testcase!
+ fio-dedupe -o 1 /dev/sr0
+ grep 'items processed'
open: No medium found
+ CHECK_RESULT 1 0 0 'fio-dedupe -o option failed'
+ actual_result=1
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -o option failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 0x
+ test -n 'fio-dedupe -o option failed'
+ LOG_ERROR 'fio-dedupe -o option failed'
+ message='fio-dedupe -o option failed'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'fio-dedupe -o option failed'
Tue Aug 22 02:59:50 2023 - ERROR - fio-dedupe -o option failed
+ (( exec_result++ ))
+ LOG_ERROR 'oe_test_fio_002.sh line 31'
+ message='oe_test_fio_002.sh line 31'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'oe_test_fio_002.sh line 31'
Tue Aug 22 02:59:50 2023 - ERROR - oe_test_fio_002.sh line 31
+ '[' 0 -eq 1 ']'
+ return 0
+ fio-dedupe -c 1 /dev/vdb
+ grep 'items processed'
Threads(4): 128000 items processed
+ CHECK_RESULT 0 0 0 'fio-dedupe -c option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -c option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio-dedupe -B 1 /dev/vdb
Will check </dev/vdb>, size <524288000>, using 4 threads
Threads(4): 128000 items processed
Extents=128000, Unique extents=0
De-dupe ratio: 1:infinite
Fio setting: dedupe_percentage=100
+ CHECK_RESULT 0 0 0 'fio-dedupe -B option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -B option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio-dedupe -p 1 /dev/vdb
Will check </dev/vdb>, size <524288000>, using 4 threads
Threads(4): 128000 items processed
Extents=128000, Unique extents=0
De-dupe ratio: 1:infinite
Fio setting: dedupe_percentage=100
+ CHECK_RESULT 0 0 0 'fio-dedupe -p option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -p option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio --filename=test_file --direct=1 --rw=randwrite --numjobs=1 --iodepth=16 --ioengine=libaio --bs=4k --group_reporting --name=zhangyi --log_avg_msec=500 --write_bw_log=test-fio --size=1G
zhangyi: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.34
Starting 1 process
zhangyi: Laying out IO file (1 file / 1024MiB)

zhangyi: (groupid=0, jobs=1): err= 0: pid=1993: Tue Aug 22 03:00:02 2023
  write: IOPS=24.1k, BW=94.0MiB/s (98.6MB/s)(1024MiB/10890msec); 0 zone resets
    slat (usec): min=4, max=3128, avg=17.26, stdev=12.14
    clat (usec): min=32, max=5191.5k, avg=646.06, stdev=40559.09
     lat (usec): min=40, max=5191.5k, avg=663.32, stdev=40559.06
    clat percentiles (usec):
     |  1.00th=[  221],  5.00th=[  247], 10.00th=[  260], 20.00th=[  277],
     | 30.00th=[  285], 40.00th=[  297], 50.00th=[  306], 60.00th=[  318],
     | 70.00th=[  330], 80.00th=[  351], 90.00th=[  400], 95.00th=[  445],
     | 99.00th=[  510], 99.50th=[  570], 99.90th=[ 1844], 99.95th=[ 2442],
     | 99.99th=[64750]
   bw (  KiB/s): min=138576, max=201539, per=100.00%, avg=177987.00, stdev=23602.75, samples=11
   iops        : min=34648, max=50384, avg=44497.00, stdev=5899.92, samples=11
  lat (usec)   : 50=0.02%, 100=0.09%, 250=6.13%, 500=92.48%, 750=0.99%
  lat (usec)   : 1000=0.05%
  lat (msec)   : 2=0.15%, 4=0.06%, 10=0.01%, 50=0.01%, 100=0.01%
  lat (msec)   : 250=0.01%, >=2000=0.01%
  cpu          : usr=5.19%, sys=26.76%, ctx=167295, majf=0, minf=13
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,262144,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=94.0MiB/s (98.6MB/s), 94.0MiB/s-94.0MiB/s (98.6MB/s-98.6MB/s), io=1024MiB (1074MB), run=10890-10890msec

Disk stats (read/write):
  vda: ios=1/250814, merge=0/892, ticks=0/102347, in_queue=107608, util=99.15%
+ CHECK_RESULT 0 0 0 'fio --filename=test_file option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio --filename=test_file option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio -filename=/dev/sr0 -direct=1 -iodepth 1 -thread -rw=read -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
+ grep sr0
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
+ CHECK_RESULT 1 0 0 'fio -filename=/dev option failed'
+ actual_result=1
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 0x
+ test -n 'fio -filename=/dev option failed'
+ LOG_ERROR 'fio -filename=/dev option failed'
+ message='fio -filename=/dev option failed'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'fio -filename=/dev option failed'
Tue Aug 22 03:00:03 2023 - ERROR - fio -filename=/dev option failed
+ (( exec_result++ ))
+ LOG_ERROR 'oe_test_fio_002.sh line 41'
+ message='oe_test_fio_002.sh line 41'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'oe_test_fio_002.sh line 41'
Tue Aug 22 03:00:03 2023 - ERROR - oe_test_fio_002.sh line 41
+ '[' 0 -eq 1 ']'
+ return 0
+ fio -filename=/dev/sr0 -direct=1 -iodepth 1 -thread -rw=write -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
+ grep sr0
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
+ CHECK_RESULT 1 0 0 'fio -filename=/dev option failed'
+ actual_result=1
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 0x
+ test -n 'fio -filename=/dev option failed'
+ LOG_ERROR 'fio -filename=/dev option failed'
+ message='fio -filename=/dev option failed'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'fio -filename=/dev option failed'
Tue Aug 22 03:00:05 2023 - ERROR - fio -filename=/dev option failed
+ (( exec_result++ ))
+ LOG_ERROR 'oe_test_fio_002.sh line 43'
+ message='oe_test_fio_002.sh line 43'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'oe_test_fio_002.sh line 43'
Tue Aug 22 03:00:05 2023 - ERROR - oe_test_fio_002.sh line 43
+ '[' 0 -eq 1 ']'
+ return 0
+ fio -filename=/dev/vdb -direct=1 -iodepth 1 -thread -rw=randread -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
mytest: (g=0): rw=randread, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=psync, iodepth=1
...
fio-3.34
Starting 30 threads

mytest: (groupid=0, jobs=30): err= 0: pid=2022: Tue Aug 22 03:00:09 2023
  read: IOPS=226k, BW=3531MiB/s (3703MB/s)(14.6GiB/4248msec)
    clat (usec): min=16, max=106071, avg=126.89, stdev=566.62
     lat (usec): min=16, max=106071, avg=127.03, stdev=566.64
    clat percentiles (usec):
     |  1.00th=[   39],  5.00th=[   53], 10.00th=[   67], 20.00th=[   85],
     | 30.00th=[   95], 40.00th=[  104], 50.00th=[  116], 60.00th=[  129],
     | 70.00th=[  143], 80.00th=[  155], 90.00th=[  172], 95.00th=[  192],
     | 99.00th=[  269], 99.50th=[  330], 99.90th=[  586], 99.95th=[  775],
     | 99.99th=[19268]
   bw (  MiB/s): min= 2760, max= 4419, per=100.00%, avg=3595.73, stdev=18.35, samples=232
   iops        : min=176674, max=282874, avg=230126.71, stdev=1174.44, samples=232
  lat (usec)   : 20=0.01%, 50=3.88%, 100=31.65%, 250=63.15%, 500=1.16%
  lat (usec)   : 750=0.11%, 1000=0.02%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=1.30%, sys=3.64%, ctx=979385, majf=0, minf=120
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=960000,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=3531MiB/s (3703MB/s), 3531MiB/s-3531MiB/s (3703MB/s-3703MB/s), io=14.6GiB (15.7GB), run=4248-4248msec

Disk stats (read/write):
  vdb: ios=944899/0, merge=0/0, ticks=90158/0, in_queue=90158, util=97.29%
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio -filename=/dev/sr0 -direct=1 -iodepth 1 -thread -rw=randwrite -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
+ grep sr0
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
+ CHECK_RESULT 1 0 0 'fio -filename=/dev option failed'
+ actual_result=1
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 0x
+ test -n 'fio -filename=/dev option failed'
+ LOG_ERROR 'fio -filename=/dev option failed'
+ message='fio -filename=/dev option failed'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'fio -filename=/dev option failed'
Tue Aug 22 03:00:10 2023 - ERROR - fio -filename=/dev option failed
+ (( exec_result++ ))
+ LOG_ERROR 'oe_test_fio_002.sh line 47'
+ message='oe_test_fio_002.sh line 47'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'oe_test_fio_002.sh line 47'
Tue Aug 22 03:00:10 2023 - ERROR - oe_test_fio_002.sh line 47
+ '[' 0 -eq 1 ']'
+ return 0
+ fio -filename=/dev/sr0 -direct=1 -iodepth 1 -thread -rw=read -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest --output test.txt
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: failed opening blockdev /dev/sr0 for size check
file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
fio: pid=0, err=123/file:filesetup.c:795, func=open(/dev/sr0), error=No medium found
+ test -f test.txt
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ genfio -d /dev/sr0,/dev/vdb,/dev/ -a -b 4k,128k,1m -r 100 -a -x dellr720-day2/
/usr/bin/genfio: line 280: hostname: command not found
Generating dellr720-day2/-4k,128k,1m-all-write,randwrite,read,randread-sr0,vdb,dev.fio
Estimated Time = 4800 seconds : 1 hour 20 minutes
+ test -d dellr720-day2
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ genfio -h
+ grep -i usage
usage of genfio:
+ CHECK_RESULT 0 0 0 'genfio -h option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='genfio -h option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ LOG_INFO 'End of testcase execution!'
+ message='End of testcase execution!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'End of testcase execution!'
Tue Aug 22 03:00:13 2023 - INFO  - End of testcase execution!
+ CASE_RESULT 0
+ case_re=0
+ test -z 4
+ test 4 -gt 0
+ LOG_ERROR 'failed to execute the case.'
+ message='failed to execute the case.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'failed to execute the case.'
Tue Aug 22 03:00:13 2023 - ERROR - failed to execute the case.
+ exit 4
+ post_test
+ LOG_INFO 'Start environment cleanup.'
+ message='Start environment cleanup.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Start environment cleanup.'
Tue Aug 22 03:00:13 2023 - INFO  - Start environment cleanup.
+ rm -rf test-fio_bw.1.log test.txt test_file dellr720-day2
+ DNF_REMOVE
+ node=1
+ pkg_list=
+ mode=0
+ [[ -z /tmp/tmp8_encupy ]]
+ '[' 0 -ne 0 ']'
+ '[' 1 == 0 ']'
+ python3 /root/mugen/libs/locallibs/rpm_manage.py remove --node 1 --pkgs '' --tempfile /tmp/tmp8_encupy
+ '[' 0 -ne 0 ']'
+ LOG_INFO 'Finish environment cleanup.'
+ message='Finish environment cleanup.'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Finish environment cleanup.'
Tue Aug 22 03:00:22 2023 - INFO  - Finish environment cleanup.